{
    "The SSL certificate for this service cannot be trusted.": 98,
    "The SSL certificate chain for this service ends in an unrecognized\nself-signed certificate.": 87,
    "The remote service encrypts traffic using an older version of TLS.": 43,
    "The remote server's SSL certificate has already expired.": 40,
    "Signing is not required on the remote SMB server.": 25,
    "The SSL certificate for this service is for a different host.": 22,
    "The remote service supports the use of the RC4 cipher.": 16,
    "The remote service supports the use of medium strength SSL ciphers.": 13,
    "An SSL certificate in the certificate chain has been signed using a\nweak hash algorithm.": 11,
    "The remote web server may fail to mitigate a class of web application\nvulnerabilities.": 10,
    "The remote SSH server is configured to allow weak key exchange algorithms.": 9,
    "The remote service encrypts traffic using a protocol with known\nweaknesses.": 8,
    "The remote Telnet server transmits traffic in cleartext.": 8,
    "The remote service supports the use of weak SSL ciphers.": 7,
    "The remote web server might transmit credentials in cleartext.": 6,
    "It is possible to obtain sensitive information from the remote host\nwith SSL/TLS-enabled services.": 6,
    "The remote web server seems to transmit credentials in cleartext.": 6,
    "The remote device is vulnerable and can be compromised": 6,
    "It is possible to obtain information about the remote host.": 5,
    "The X.509 certificate chain used by this service contains certificates\nwith RSA keys shorter than 2048 bits.": 4,
    "The remote web server is affected by multiple cross site scripting\nvulnerability.": 4,
    "The remote web server hosts a PHP application that is affected by\nmultiple vulnerabilities.": 4,
    "The remote web server discloses process information.": 3,
    "Debugging functions are enabled on the remote web server.": 3,
    "Some directories on the remote web server are browsable.": 3,
    "The remote DHCP server may expose information about the associated\nnetwork.": 2,
    "The remote web server hosts a PHP application that is affected by SQLi vulnerability.": 2,
    "The remote web server hosts a PHP application that is affected by a CSRF vulnerability.": 2,
    "The remote web server hosts a PHP application that is affected by a SQL injection vulnerability.": 2,
    "The SSH server is configured to use Cipher Block Chaining.": 2,
    "The remote SSH server is configured to allow MD5 and 96-bit MAC\nalgorithms.": 2,
    "The remote host allows SSL/TLS connections with one or more\nDiffie-Hellman moduli less than or equal to 1024 bits.": 1,
    "The remote host is running a service that allows cleartext\nauthentication.": 1,
    "The remote mail server allows cleartext logins.": 1,
    "The X.509 certificate chain used by this service contains certificates\nwith RSA keys shorter than 1024 bits.": 1,
    "The remote host has IP forwarding enabled.": 1,
    "An X.509 certificate in the chain used by this service fails to\nadhere to all of its basic constraints and key usage extensions.": 1
}